Mina-Karam/Master_Embedded_Systems/Unit_8_MCU_Interfacing/Lesson_7_I2C_Driver/Lecture/STM32F103x6-Driver/MCAL/stm32f103x6_I2C_driver.c
		/* 6. Configure ADDMODE Addressing mode (slave mode) */
		Temp_Register |= I2C_Config->Slave_Address.Slave_Address_Mode ;

		/* 7. Set the "I2C_OAR1" register with our new value */
		I2Cx->OAR1 = Temp_Register;
	}
	else
	{
		/* Not support I2C_MODE_SMBUS_MODE*/
	}


	/* 3. Interrupt mode (Slave Mode) ==> Check the callback pointer != NULL */
	if(I2C_Config->P_Slave_CallBack != NULL) // That enable slave IRQ states mode
	{
		/* 1. Enable IRQ */
		I2Cx->CR2 |= (I2C_CR2_ITERREN); // Error interrupt enable
		I2Cx->CR2 |= (I2C_CR2_ITEVTEN); // Event interrupt enable
		I2Cx->CR2 |= (I2C_CR2_ITBUFEN); // Buffer interrupt enable

		/* 2. Enable IRQ in NVIC */
		if(I2Cx == I2C1)
		{
			NVIC_IRQ31_I2C1_EV_IRQ_EN();
			NVIC_IRQ32_I2C1_ER_IRQ_EN();
		}
		else if (I2Cx == I2C2)
		{
			NVIC_IRQ33_I2C2_EV_IRQ_EN();
			NVIC_IRQ34_I2C2_ER_IRQ_EN();
		}

		/* 3. Put the status registers with zero */
		I2Cx->SR1 = 0;
		I2Cx->SR2 = 0;
	}

	/* 4. Enable the selected I2C peripheral */
	I2Cx->CR1 |= I2C_CR1_PE;
}

/* ================================================================
 * @Fn 				- MCAL_I2C_DeInit
 * @brief 			- Resets Selected I2C Module and disable NVIC IRQs
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @retval 			- None
 * Note 			- Reset The Module By RCC & Disable NVIC
 */
void MCAL_I2C_DeInit(I2C_Typedef_t *I2Cx)
{
	if (I2Cx == I2C1)
	{
		NVIC_IRQ31_I2C1_EV_IRQ_DI();
		NVIC_IRQ32_I2C1_ER_IRQ_DI();
		RCC_I2C1_RESET();
	}
	else if(I2Cx == I2C2)
	{
		NVIC_IRQ33_I2C2_EV_IRQ_DI();
		NVIC_IRQ34_I2C2_ER_IRQ_DI();
		RCC_I2C2_RESET();
	}
}

/* ================================================================
 * @Fn 				- MCAL_I2C_GPIO_Set_Pins
 * @brief 			- Initializes GPIO Pins to be connected with the selected I2C
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @retval 			- None
 * Note 			- Must open clock for AFIO & GPIO After GPIO Initialization
 * 					- Supported for I2C SM MODE only
 */
void MCAL_I2C_GPIO_Set_Pins(I2C_Typedef_t *I2Cx)
{
	GPIO_PinConfig_t I2C_GPIO_Config;

	/* Depending the recommendation in data sheet -> Table 27. I2C 	*/
	/*  "I2C pin-out"    "Configuration"     "GPIO configuration" 	*/
	if(I2Cx == I2C1)
	{
		/* PB6 : I2C1_SCL */
		I2C_GPIO_Config.GPIO_PinNumber = GPIO_PIN_6;
		I2C_GPIO_Config.GPIO_Mode = GPIO_MODE_OUTPUT_AF_OD;
		I2C_GPIO_Config.GPIO_Speed = GPIO_SPEED_10M;
		MCAL_GPIO_Init(GPIOB, &I2C_GPIO_Config);

		/* PB7 : I2C1_SDA */
		I2C_GPIO_Config.GPIO_PinNumber = GPIO_PIN_7;
		I2C_GPIO_Config.GPIO_Mode = GPIO_MODE_OUTPUT_AF_OD;
		I2C_GPIO_Config.GPIO_Speed = GPIO_SPEED_10M;
		MCAL_GPIO_Init(GPIOB, &I2C_GPIO_Config);
	}
	else if(I2Cx == I2C2)
	{
		/* PB10 : I2C2_SCL */
		I2C_GPIO_Config.GPIO_PinNumber = GPIO_PIN_10;
		I2C_GPIO_Config.GPIO_Mode = GPIO_MODE_OUTPUT_AF_OD;
		I2C_GPIO_Config.GPIO_Speed = GPIO_SPEED_10M;
		MCAL_GPIO_Init(GPIOB, &I2C_GPIO_Config);

		/* PB10 : I2C2_SDA */
		I2C_GPIO_Config.GPIO_PinNumber = GPIO_PIN_11;
		I2C_GPIO_Config.GPIO_Mode = GPIO_MODE_OUTPUT_AF_OD;
		I2C_GPIO_Config.GPIO_Speed = GPIO_SPEED_10M;
		MCAL_GPIO_Init(GPIOB, &I2C_GPIO_Config);
	}
}

/* ================================================================
 * @Fn 				- MCAL_I2C_MASTER_TX
 * @brief 			- Master Send data with I2C
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @param [in] 		- Device_Address : slave address
 * @param [in] 		- pTxData : a pointer to the data which will be send
 * @param [in] 		- Data_Length : number of data bytes to be Transmitted
 * @param [in] 		- Stop : select send stop bit or not
 * @param [in] 		- Start : select send start or repeated start
 * @retval 			- None
 * Note 			- None
 */
void MCAL_I2C_MASTER_TX(I2C_Typedef_t *I2Cx, uint16_t Device_Address, uint8_t *pTxData, uint8_t Data_Length, STOP_Condition Stop, START_Condition Start)
{
	int i = 0;

	/* TODO Support timeout (configure timer working for specific duration rise interrupt)
	 * TODO Timer_interrupt(){flag =}
	 * TODO so any code exist in while (check flag || any polling conditions)
	 */
	/* 1. Set the start bit in the I2C_CR1 register to generate a start condition from this will start as master */
	I2C_Generate_Start(I2Cx, Start, Enable);

	/* 2. Wait for EV5 */
	/* EV5: SB=1, cleared by reading SR1 register followed by writing DR register with Address. */
	while(!(I2C_Get_FlagStatus(I2Cx, SB)));

	/* 3. Writing DR register with Address, Send Address */
	I2C_Send_Address(I2Cx, Device_Address, Transmitter);

	/* 4. Wait for EV6 */
	/* EV6: ADDR=1, cleared by reading SR1 register followed by reading SR2. */
	while(!(I2C_Get_FlagStatus(I2Cx, ADDR)));

	/* 5. Wait for EV8_1 */
	/* EV8_1: TxE=1, shift register empty, data register empty, write Data1 in DR. */
	/* Check for TRA: Transmitter/receiver, BUSY: Bus busy, MSL: Master/slave, TxE Flags */
	while(!(I2C_Get_FlagStatus(I2Cx, Master_Transmitter_Event)));

	/* Loop inside the data ready to send it */
	for (i = 0; i < Data_Length; ++i)
	{
		/* 6. Write in the DR register the data to be sent */
		I2Cx->DR = pTxData[i];

		/* 7. Wait for EV8 */
		/* EV8: TxE=1, shift register not empty, data register empty, cleared by writing DR register. */
		while(!(I2C_Get_FlagStatus(I2Cx, TXE)));
		/* 8. Wait for EV8 */
		/* EV8_2: TxE=1, BTF = 1, Program Stop request. TxE and BTF are cleared by hardware by the Stop condition. */
	}

	/* 9. Send Stop Condition */
	if(Stop == With_STOP)
	{
		I2C_Stop(I2Cx, Enable);
	}
}

/* ================================================================
 * @Fn 				- MCAL_I2C_MASTER_RX
 * @brief 			- Master Receive data with I2C
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @param [in] 		- Device_Address : slave address
 * @param [in] 		- pRxData : a pointer to the data which will be send
 * @param [in] 		- Data_Length : number of data bytes to be Received
 * @param [in] 		- Stop : select send stop bit or not
 * @param [in] 		- Start : select send start or repeated start
 * @retval 			- None
 * Note 			- None
 */
void MCAL_I2C_MASTER_RX(I2C_Typedef_t *I2Cx, uint16_t Device_Address, uint8_t *pRxData, uint8_t Data_Length, STOP_Condition Stop, START_Condition Start)
{
	int i = 0;

	uint8_t index = I2Cx == I2C1 ? I2C1_Index : I2C2_Index;
	/* TODO Support timeout (configure timer working for specific duration rise interrupt)
	 * TODO Timer_interrupt(){flag =}
	 * TODO so any code exist in while (check flag || any polling conditions)
	 */
	/* 1. Set the start bit in the I2C_CR1 register to generate a start condition from this will start as master */
	I2C_Generate_Start(I2Cx, Start, Enable);

	/* 2. Wait for EV5 */
	/* EV5: SB=1, cleared by reading SR1 register followed by writing DR register with Address. */
	while(!(I2C_Get_FlagStatus(I2Cx, SB)));

	/* 3. Writing DR register with Address, Send Address */
	I2C_Send_Address(I2Cx, Device_Address, Receiver);

	/* 4. Wait for EV6 */
	/* EV6: ADDR=1, cleared by reading SR1 register followed by reading SR2. */
	while(!(I2C_Get_FlagStatus(I2Cx, ADDR)));

	/* 5. Enable Automatic ACK */
	/* To get ready to send ACK */
	I2C_ACKConfig(I2Cx, Enable);

